{
  "main": {
    "name": "Mario Merino",
    "occupation": "Front End Developer",
    "description": "During my free time i enjoy reading books and improving my skills feel free to look around!",
    "image": "profilepic.jpg",
    "bio": "My name is Mario Merino.  I am a Web Developer by trade and an ok Mechanic/Photographer in my free time.  I was one of the first hires at a successful startup and learned their stack quickly and efficiently. I’m passionate about technology - not a specific framework or language. In this line of work, it's about adaptation, and what works best for the project. I’m open to learning any stack if it works.",
    "contactmessage": "Let create something special together!",
    "email": "mmerino1010@protonmail.com",
    "phone": "Please Text: 713-264-1104",
    "address": {
      "city": "Houston",
      "state": "Texas",
      "zip": "77071"
    },
    "website": "http://www.marioalbertomerino.com",
    "resumedownload": "http://s000.tinyupload.com/?file_id=98192481747372386509",
    "social": [
      {
        "name": "linkedin",
        "url": "https://www.linkedin.com/in/mario-merino-77666418a/",
        "className": "fa fa-linkedin"
      },
      {
        "name": "instagram",
        "url": "http://instagram.com/arevalo_visuals",
        "className": "fa fa-instagram"
      },
      {
        "name": "github",
        "url": "https://github.com/solarstar101",
        "className": "fa fa-github"
      },
      {
        "name": "skype",
        "url": "http://skype.com/mmerino1010",
        "className": "fa fa-skype"
      }
    ]
  },
  "resume": {
    "education": [
      {
        "school": "San Jacinto College",
        "degree": "Associate in Computer Technology",
        "description": " Thorough education in the underlying theory, concepts, and science behind more complex programming. It was here that I discovered my passion for scalable application programming (web and mobile), the security behind computer and application systems, and found that I had a knack for web development"
      }
    ],
    "work": [
      {
        "company": " University of Texas Health Science Center ",
        "title": "Web Developer III ",
        "years": "Aug 2019 - Present",
        "description": "Responsible for creating new web applications to be used internally by the university by staff and students while maintaining WCAG 2.0 Accessibility AA Working within dotCMS using a headless cms approach to create and implement different functionality to web pages and web applications with react on the frontend."
      },
      {
        "company": "LKQ Corporation",
        "title": "Front End Engineer",
        "years": "Nov 2017 - Aug 2019",
        "description": "Responsible for technical SEO and maintaining LKQ websites fixing bugs and applying updates and adding features as needed, tasked with creating front end interface of a b2b web application for APO division."
      },
      {
        "company": "Find-Marketing",
        "title": "Front End Developer",
        "years": "Dec 2015 - Nov 2017",
        "description": "Designed Developed & Launched several web applications using various technologies but mostly worked with React, Node, and Redux. Worked on several large and small scale applications focusing on maintenance, security, and efficiency of different web applications focused on making pages highly scalable and created high traffic solutions."
      }
    ],
    "skills": [
      {
        "name": "Git",
        "description": "I use Git for all of my projects so far. I have used Git for version control in small teams and have toyed around with contributing to Open Source Projects",
        "image": "images/tech/git.jpg"
      },
      {
        "name": "Javascript",
        "description": "Javascript was my first programming language that I started using in college years ago. It is by far the language I am most familiar with in terms of data-structure.",
        "image": "images/tech/javascript.png"
      },
      {
        "name": "React JS",
        "description": "I am in love with React It has grown on me and quickly became my go to js library this site was made with React along with several of my project",
        "image": "images/tech/react.jpg"
      },
      {
        "name": "Node JS",
        "description": "Node JS is my server-side scripting language of choice. The bulk of my experience with it has been in conjunction with MeteorJS-based projects",
        "image": "images/tech/node.jpg"
      },
      {
        "name": "Express",
        "description": "I use Express as my go to framework for node. It is my favorite becasue it is fast, non-opinionated and minimalistic. In my opinion it offers a simpler interface for creating my request endpoints,",
        "image": "images/tech/expressjs.png"
      },
      {
        "name": "MongoDB",
        "description": "I have used many different database systems and I am better educated and experienced with Relational Databases. However, for many applications, the ease of use of MongoDB better suits my needs ",
        "image": "images/tech/mongo.jpg"
      },
      {
        "name": "Semantic-UI",
        "description": "I use Semantic-UI more often than not when creating sites.Being able to handpick the components i actually need helps me reduce file size/load time not to mention the ease of customization",
        "image": "images/tech/semanticui.jpg"
      },
      {
        "name": "Netlify",
        "description": "I use Netlify as my hosting platform for most of my projects because so far they are all unpaid and their free tier is convenient. I also appreciate its integration with Github for such simple deployment.",
        "image": "images/tech/netlify.png"
      }
    ]
  },
  "portfolio": {
    "projects": [
      {
        "title": "React Palette Generator",
        "category": "A React based palette generator using local storage",
        "image": "ReactPalette.jpg",
        "url": "https://silly-johnson-47bce1.netlify.com/"
      },
      {
        "title": "React Sorting Algorithm App",
        "category": "React Sorting Algorithm visualizer react-hooks and styled components",
        "image": "ReactSorting.jpg",
        "url": "https://laughing-feynman-96fb8b.netlify.com/index.html"
      },
      {
        "title": "Sushi Restaurant",
        "category": "A React based sushi restaurant with checkout",
        "image": "Sushi.png",
        "url": "https://focused-villani-02d952.netlify.com/#/"
      },
      {
        "title": "The Light Photography",
        "category": "Photography site with SEO enhancements",
        "image": "thelightphotography.jpg",
        "url": "https://fervent-goldstine-6db215.netlify.com"
      },
      {
        "title": "Novak Law",
        "category": "Website for local houston lawyer!",
        "image": "NovakLaw.jpg",
        "url": "http://www.novaklaw.org/"
      }
    ]
  }
}
